# 이 Mac 설정에서 설치할 Homebrew 패키지와 앱 목록입니다.

# 기본 도구
brew "git"
brew "gh"
brew "mas"

# CLI 유틸리티
brew "neovim"
brew "bat"
brew "starship"
brew "fonttools"
brew "mise"

# 문서 작업
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Keynote", id: 361285480

# 유틸리티
mas "RunCat", id: 1429033973
mas "Dropover - Easier Drag & Drop", id: 1355679052
cask "ghostty"

# 메신저
cask "discord"
mas "KakaoTalk", id: 869223134
cask "telegram"

# 브라우저
cask "google-chrome"

# 게임
cask "steam"
cask "crossover"

# 프로그래밍 도구
cask "codex-app"
cask "visual-studio-code"
